music_app/app/models/user.rb

    def reset_session_token!
        self.session_token = User.generate_session_token
        self.save!
---
UPDATE "users" SET "session_token" = $1 WHERE "users"."id" = $2  [["session_token", "FxbUE_4KqPSM5l6mWM_NoQ"], ["id", 1]]